Revit 2027 API
ParameterTypeId.DividedSurfacePatternRotationAngle Property
 "Component Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfacePatternRotationAngle { get; }
Public Shared ReadOnly Property DividedSurfacePatternRotationAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfacePatternRotationAngle {
	ForgeTypeId^ get ();
}
static member DividedSurfacePatternRotationAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace